apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_posif.h
/****************************************************************************
 * arch/arm/src/xmc4/hardware/xmc4_posif.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 * May include some logic from sample code provided by Infineon:
 *
 * Copyright (C) 2011-2015 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use
 * with Infineon's microcontrollers.  This file can be freely distributed
 * within development tools that are supporting such microcontrollers.
 *
 * THIS SOFTWARE IS PROVIDED AS IS. NO WARRANTIES, WHETHER EXPRESS,
 * IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES
 * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS
 * SOFTWARE. INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR
 * SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ****************************************************************************/

/* Reference: XMC[8-7]00 Reference Manual. */

#ifndef __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_POSIF_H
#define __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_POSIF_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/xmc4_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

/* POSIF Kernel Registers */

#define XMC4_POSIF_PCONF_OFFSET 0x0000  /* Global control register */
#define XMC4_POSIF_PSUS_OFFSET  0x0004  /* Suspend configuration */
#define XMC4_POSIF_PRUNS_OFFSET 0x0008  /* POSIF Run Bit set */
#define XMC4_POSIF_PRUNC_OFFSET 0x000C  /* POSIF Run Bit clear */
#define XMC4_POSIF_PRUN_OFFSET  0x0010  /* POSIF Run Bit status */
#define XMC4_POSIF_PDBG_OFFSET  0x0100  /* Debug design register */
#define XMC4_POSIF_MIDR_OFFSET  0x0020  /* Module identification register */

/* Hall Sensor Mode Registers */

#define XMC4_POSIF_HALP_OFFSET  0x0030  /* Hall Current and Expected patterns */
#define XMC4_POSIF_HALPS_OFFSET 0x0034  /* Hall Current and Expected Shadow paterns */

/* Multi-Channel Mode Registers */

#define XMC4_POSIF_MCM_OFFSET  0x0040  /* Multi-Channel Mode Patern */
#define XMC4_POSIF_MCSM_OFFSET 0x0044  /* Multi-Channel Mode Shadow Patern */
#define XMC4_POSIF_MCMS_OFFSET 0x0048  /* Multi-Channel Mode Control Set */
#define XMC4_POSIF_MCMC_OFFSET 0x004C  /* Multi-Channel Mode Control Clear */
#define XMC4_POSIF_MCMF_OFFSET 0x0050  /* Multi-Channel Mode Flag Status */

/* Quadrature Decoder Mode Register */

#define XMC4_POSIF_QDC_OFFSET 0x0060 /* Quadrature Decoder Configuration */

/* Interrupt Registers */

#define XMC4_POSIF_PFLG_OFFSET  0x0070  /* POSIF Interrupt status */
#define XMC4_POSIF_PFLGE_OFFSET 0x0074  /* POSIF interrupt enable */
#define XMC4_POSIF_SPFLG_OFFSET 0x0078  /* Interrupt set register */
#define XMC4_POSIF_RPFLG_OFFSET 0x007C  /* Interrupt clear register */

/* POSIF0 Registers *********************************************************/

#define XMC4_POSIF0_PCONF (XMC4_POSIF0_BASE + XMC4_POSIF_PCONF_OFFSET)  /* Global control register */
#define XMC4_POSIF0_PSUS  (XMC4_POSIF0_BASE + XMC4_POSIF_PSUS_OFFSET)   /* Suspend configuration */
#define XMC4_POSIF0_PRUNS (XMC4_POSIF0_BASE + XMC4_POSIF_PRUNS_OFFSET)  /* POSIF Run Bit set */
#define XMC4_POSIF0_PRUNC (XMC4_POSIF0_BASE + XMC4_POSIF_PRUNC_OFFSET)  /* POSIF Run Bit clear */
#define XMC4_POSIF0_PRUN  (XMC4_POSIF0_BASE + XMC4_POSIF_PRUN_OFFSET)   /* POSIF Run Bit status */
#define XMC4_POSIF0_PDBG  (XMC4_POSIF0_BASE + XMC4_POSIF_PDBG_OFFSET)   /* Debug design register */
#define XMC4_POSIF0_MIDR  (XMC4_POSIF0_BASE + XMC4_POSIF_MIDR_OFFSET)   /* Module identification register */

#define XMC4_POSIF0_HALP  (XMC4_POSIF0_BASE + XMC4_POSIF_HALP_OFFSET)   /* Hall Current and Expected patterns */
#define XMC4_POSIF0_HALPS (XMC4_POSIF0_BASE + XMC4_POSIF_HALPS_OFFSET)  /* Hall Current and Expected Shadow paterns */

#define XMC4_POSIF0_MCM  (XMC4_POSIF0_BASE + XMC4_POSIF_MCM_OFFSET)   /* Multi-Channel Mode Patern */
#define XMC4_POSIF0_MCSM (XMC4_POSIF0_BASE + XMC4_POSIF_MCSM_OFFSET)  /* Multi-Channel Mode Shadow Patern */
#define XMC4_POSIF0_MCMS (XMC4_POSIF0_BASE + XMC4_POSIF_MCMS_OFFSET)  /* Multi-Channel Mode Control Set */
#define XMC4_POSIF0_MCMC (XMC4_POSIF0_BASE + XMC4_POSIF_MCMC_OFFSET)  /* Multi-Channel Mode Control Clear */
#define XMC4_POSIF0_MCMF (XMC4_POSIF0_BASE + XMC4_POSIF_MCMF_OFFSET)  /* Multi-Channel Mode Flag Status */

#define XMC4_POSIF0_QDC (XMC4_POSIF0_BASE + XMC4_POSIF_QDC_OFFSET)  /* Quadrature Decoder Configuration */

#define XMC4_POSIF0_PFLG  (XMC4_POSIF0_BASE + XMC4_POSIF_PFLG_OFFSET)   /* POSIF Interrupt status */
#define XMC4_POSIF0_PFLGE (XMC4_POSIF0_BASE + XMC4_POSIF_PFLGE_OFFSET)  /* POSIF interrupt enable */
#define XMC4_POSIF0_SPFLG (XMC4_POSIF0_BASE + XMC4_POSIF_SPFLG_OFFSET)  /* Interrupt set register */
#define XMC4_POSIF0_RPFLG (XMC4_POSIF0_BASE + XMC4_POSIF_RPFLG_OFFSET)  /* Interrupt clear register */

/* POSIF1 Registers *********************************************************/

