apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_posif.h
#define XMC4_POSIF1_PCONF (XMC4_POSIF1_BASE + XMC4_POSIF_PCONF_OFFSET)  /* Global control register */
#define XMC4_POSIF1_PSUS  (XMC4_POSIF1_BASE + XMC4_POSIF_PSUS_OFFSET)   /* Suspend configuration */
#define XMC4_POSIF1_PRUNS (XMC4_POSIF1_BASE + XMC4_POSIF_PRUNS_OFFSET)  /* POSIF Run Bit set */
#define XMC4_POSIF1_PRUNC (XMC4_POSIF1_BASE + XMC4_POSIF_PRUNC_OFFSET)  /* POSIF Run Bit clear */
#define XMC4_POSIF1_PRUN  (XMC4_POSIF1_BASE + XMC4_POSIF_PRUN_OFFSET)   /* POSIF Run Bit status */
#define XMC4_POSIF1_PDBG  (XMC4_POSIF1_BASE + XMC4_POSIF_PDBG_OFFSET)   /* Debug design register */
#define XMC4_POSIF1_MIDR  (XMC4_POSIF1_BASE + XMC4_POSIF_MIDR_OFFSET)   /* Module identification register */

#define XMC4_POSIF1_HALP  (XMC4_POSIF1_BASE + XMC4_POSIF_HALP_OFFSET)   /* Hall Current and Expected patterns */
#define XMC4_POSIF1_HALPS (XMC4_POSIF1_BASE + XMC4_POSIF_HALPS_OFFSET)  /* Hall Current and Expected Shadow paterns */

#define XMC4_POSIF1_MCM  (XMC4_POSIF1_BASE + XMC4_POSIF_MCM_OFFSET)   /* Multi-Channel Mode Patern */
#define XMC4_POSIF1_MCSM (XMC4_POSIF1_BASE + XMC4_POSIF_MCSM_OFFSET)  /* Multi-Channel Mode Shadow Patern */
#define XMC4_POSIF1_MCMS (XMC4_POSIF1_BASE + XMC4_POSIF_MCMS_OFFSET)  /* Multi-Channel Mode Control Set */
#define XMC4_POSIF1_MCMC (XMC4_POSIF1_BASE + XMC4_POSIF_MCMC_OFFSET)  /* Multi-Channel Mode Control Clear */
#define XMC4_POSIF1_MCMF (XMC4_POSIF1_BASE + XMC4_POSIF_MCMF_OFFSET)  /* Multi-Channel Mode Flag Status */

#define XMC4_POSIF1_QDC (XMC4_POSIF1_BASE + XMC4_POSIF_QDC_OFFSET)  /* Quadrature Decoder Configuration */

#define XMC4_POSIF1_PFLG  (XMC4_POSIF1_BASE + XMC4_POSIF_PFLG_OFFSET)   /* POSIF Interrupt status */
#define XMC4_POSIF1_PFLGE (XMC4_POSIF1_BASE + XMC4_POSIF_PFLGE_OFFSET)  /* POSIF interrupt enable */
#define XMC4_POSIF1_SPFLG (XMC4_POSIF1_BASE + XMC4_POSIF_SPFLG_OFFSET)  /* Interrupt set register */
#define XMC4_POSIF1_RPFLG (XMC4_POSIF1_BASE + XMC4_POSIF_RPFLG_OFFSET)  /* Interrupt clear register */

/* POSIF Mask and SHIFTitions ***********************************************/

/* PCONF - POSIF Configuration */
#define POSIF_PCONF_FSEL_SHIFT    (0)                                           /* Bits 0-1 : Function Selector */
#define POSIF_PCONF_FSEL_MASK     (3 << POSIF_PCONF_FSEL_SHIFT)
#define POSIF_PCONF_QDCM_SHIFT    (2)                                           /* Bits 2 : Position Decoder Mode Selection */
#define POSIF_PCONF_QDCM_MASK     (1 << POSIF_PCONF_QDCM_SHIFT)
#define POSIF_PCONF_HIDG_SHIFT    (4)                                           /* Bit 4 : Idle generation enable */
#define POSIF_PCONF_HIDG_MASK     (1 << POSIF_PCONF_HIDG_SHIFT)
#define POSIF_PCONF_MCUE_SHIFT    (5)                                           /* Bit 5 : Multi-Channel pattern SW update enable */
#define POSIF_PCONF_MCUE_MASK     (1 << POSIF_PCONF_MCUE_SHIFT)
#define POSIF_PCONF_INSEL0_SHIFT  (8)                                           /* Bits 8-9 : PhaseA/Hal input 1 selector */
#define POSIF_PCONF_INSEL0_MASK   (3 << POSIF_PCONF_INSEL0_SHIFT)
#define POSIF_PCONF_INSEL1_SHIFT  (10)                                          /* Bits 10-11 : PhaseB/Hal input2 selector */
#define POSIF_PCONF_INSEL1_MASK   (3 << POSIF_PCONF_INSEL1_SHIFT)
#define POSIF_PCONF_INSEL2_SHIFT  (12)                                          /* Bits 12-13 : Index/Hall input 3 selector */
#define POSIF_PCONF_INSEL2_MASK   (3 << POSIF_PCONF_INSEL2_SHIFT)
#define POSIF_PCONF_DSEL_SHIFT    (16)                                          /* Bit 16 : Delay Pin selector */
#define POSIF_PCONF_DSEL_MASK     (1 << POSIF_PCONF_DSEL_SHIFT)
#define POSIF_PCONF_SPES_SHIFT    (17)                                          /* Bit 17 : Edge selector for the sampling trigger */
#define POSIF_PCONF_SPES_MASK     (1 << POSIF_PCONF_SPES_SHIFT)
#define POSIF_PCONF_MSETS_SHIFT   (18)                                          /* Bits 18-20 : Pattern update signal select */
#define POSIF_PCONF_MSETS_MASK    (7 << POSIF_PCONF_MSETS_SHIFT)
#define POSIF_PCONF_MSES_SHIFT    (21)                                          /* Bit 21 : Multi-Channel pattern update trigger edge */
#define POSIF_PCONF_MSES_MASK     (1 << POSIF_PCONF_MSES_SHIFT)
#define POSIF_PCONF_MSYNS_SHIFT   (22)                                          /* Bits 22-23 : PWM Synchronization signal selector */
#define POSIF_PCONF_MSYNS_MASK    (3 << POSIF_PCONF_MSYNS_SHIFT)
#define POSIF_PCONF_EWIS_SHIFT    (24)                                          /* Bits 24-25 : Wrong Hall Event selection */
#define POSIF_PCONF_EWIS_MASK     (3 << POSIF_PCONF_EWIS_SHIFT)
#define POSIF_PCONF_EWIE_SHIFT    (26)                                          /* Bit 26 : External Wrong Hall Event enable */
#define POSIF_PCONF_EWIE_MASK     (1 << POSIF_PCONF_EWIE_SHIFT)
#define POSIF_PCONF_EWIL_SHIFT    (27)                                          /* Bit 27 : External Wrong Hall Event active level */
#define POSIF_PCONF_EWIL_MASK     (1 << POSIF_PCONF_EWIL_SHIFT)
#define POSIF_PCONF_LPC_SHIFT     (28)                                          /* Bits 28-30 : Low Pass Filter Configuration */
#define POSIF_PCONF_LPC_MASK      (7 << POSIF_PCONF_LPC_SHIFT)

/* PSUS - Suspend Configuration */
#define POSIF_PSUS_QSUS_SHIFT     (0)                                           /* Bits 0-1 : Quadrature Mode Suspend Config */
#define POSIF_PSUS_QSUS_MASK      (3 << POSIF_PSUS_QSUS_SHIFT)
#define POSIF_PSUS_MSUS_SHIFT     (2)                                           /* Bits 2-3 : Multi-Channel Mode Suspend Config */
#define POSIF_PSUS_MSUS_MASK      (3 << POSIF_PSUS_MSUS_SHIFT)

/* PRUNS - POSIF run bit set */
#define POSIF_PRUNS_SRB_SHIFT     (0)                                           /* Bit 0 : Set Run Bit */
#define POSIF_PRUNS_SRB_MASK      (1 << POSIF_PRUNS_SRB_SHIFT)

/* PRUNC - POSIF run bit clear */
#define POSIF_PRUNC_CRB_SHIFT     (0)                                           /* Bit 0 : Clear Run Bit*/
#define POSIF_PRUNC_CRB_MASK      (1 << POSIF_PRUNC_CRB_SHIFT)
#define POSIF_PRUNC_CSM_SHIFT     (1)                                           /* Bit 1 : Clear Current internal status */
#define POSIF_PRUNC_CSM_MASK      (1 << POSIF_PRUNC_CSM_SHIFT)

/* PRUN - POSIF run bit status */
#define POSIF_PRUN_RB_SHIFT       (0)                                           /* Bit 0 : Run Bit */
#define POSIF_PRUN_RB_MASK        (1 << POSIF_PRUN_RB_SHIFT)

/* MIDR - Module Identification register */
#define POSIF_MIDR_MODR_SHIFT     (0)                                           /* Bits 0-7 : Module Revision */
#define POSIF_MIDR_MODR_MASK      (0xff << POSIF_MIDR_MODR_SHIFT)
#define POSIF_MIDR_MODT_SHIFT     (8)                                           /*  Bits 8-15 : Module Type */
#define POSIF_MIDR_MODT_MASK      (0xff << POSIF_MIDR_MODT_SHIFT)
#define POSIF_MIDR_MODN_SHIFT     (16)                                          /* Bits 16-31 : Module Number */
#define POSIF_MIDR_MODN_MASK      (0xffff << POSIF_MIDR_MODN_SHIFT)

/* HALP - Hall Current and Expected patterns */
#define POSIF_HALP_HCP_SHIFT      (0)                                           /* Bits 0-2 : Hall Current Pattern */
#define POSIF_HALP_HCP_MASK       (7 << POSIF_HALP_HCP_SHIFT)
#define POSIF_HALP_HEP_SHIFT      (3)                                           /* Bits 3-5 : Hall Expected Pattern */
#define POSIF_HALP_HEP_MASK       (7 << POSIF_HALP_HEP_SHIFT)

