apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_posif.h
/* HALPS - Hall Current and Expected shadow patterns */
#define POSIF_HALPS_HCPS_SHIFT    (0)                                           /* Bits 0-2 : Shadow Hall Current Pattern */
#define POSIF_HALPS_HCPS_MASK     (7 << POSIF_HALPS_HCPS_SHIFT)
#define POSIF_HALPS_HEPS_SHIFT    (3)                                           /* Bits 3-5 : Shadow Hall Expected Pattern */
#define POSIF_HALPS_HEPS_MASK     (7 << POSIF_HALPS_HEPS_SHIFT)

/* MCM - Multi-Channel Mode Pattern */
#define POSIF_MCM_MCMP_SHIFT      (0)                                           /* Bits 0-15 : Multi-Channel Pattern */
#define POSIF_MCM_MCMP_MASK       (0xffff << POSIF_MCM_MCMP_SHIFT)

/* MCSM - Multi-Channel Mode shadow Pattern */
#define POSIF_MCSM_MCMPS_SHIFT    (0)                                           /* Bits 0-15 : Shadow Multi-Channel Pattern */
#define POSIF_MCSM_MCMPS_MASK     (0xffff << POSIF_MCSM_MCMPS_SHIFT)

/* MCMS - Multi-Channel Mode Control set */
#define POSIF_MCMS_MNPS_SHIFT     (0)                                           /* Bit 0 : Multi-Channel Pattern Update Enable Set */
#define POSIF_MCMS_MNPS_MASK      (1 << POSIF_MCMS_MNPS_SHIFT)
#define POSIF_MCMS_STHR_SHIFT     (1)                                           /* Bit 1 : Hall Pattern Shadow Transfer Request */
#define POSIF_MCMS_STHR_MASK      (1 << POSIF_MCMS_STHR_SHIFT)
#define POSIF_MCMS_STMR_SHIFT     (2)                                           /* Bit 2 : Multi-Channel Shadow Transfer Request */
#define POSIF_MCMS_STMR_MASK      (1 << POSIF_MCMS_STMR_SHIFT)

/* MCMC - Multi-Channel Mode Control clear */
#define POSIF_MCMC_MNPC_SHIFT     (0)                                           /* Bit 0 : Multi-Channel Pattern Update Enable Clear */
#define POSIF_MCMC_MNPC_MASK      (1 << POSIF_MCMC_MNPC_SHIFT)
#define POSIF_MCMC_MPC_SHIFT      (1)                                           /* Bit 1 : Multi-Channel Pattern clear */
#define POSIF_MCMC_MPC_MASK       (1 << POSIF_MCMC_MPC_SHIFT)

/* MCMF - Multi-Channel Mode flag status */
#define POSIF_MCMF_MSS_SHIFT      (0)                                           /* Bit 0 : Multi-Channel Pattern update status */
#define POSIF_MCMF_MSS_MASK       (1 << POSIF_MCMF_MSS_SHIFT)

/* QDC - Quadrature Decoder Configuration */
#define POSIF_QDC_PALS_SHIFT      (0)                                           /* Bit 0 : Phase A Level selector */
#define POSIF_QDC_PALS_MASK       (1 << POSIF_QDC_PALS_SHIFT)
#define POSIF_QDC_PBLS_SHIFT      (1)                                           /* Bit 1 : Phase B Level selector */
#define POSIF_QDC_PBLS_MASK       (1 << POSIF_QDC_PBLS_SHIFT)
#define POSIF_QDC_PHS_SHIFT       (2)                                           /* Bit 2 : Phase signals swap */
#define POSIF_QDC_PHS_MASK        (1 << POSIF_QDC_PHS_SHIFT)
#define POSIF_QDC_ICM_SHIFT       (4)                                           /* Bits 4-5 : Index Marker generations control */
#define POSIF_QDC_ICM_MASK        (3 << POSIF_QDC_ICM_SHIFT)
#define POSIF_QDC_DVAL_SHIFT      (8)                                           /* Bit 8 : Current rotation direction */
#define POSIF_QDC_DVAL_MASK       (1 << POSIF_QDC_DVAL_SHIFT)

/* PFLG - POSIF interrupt status */
#define POSIF_PFLG_CHES_SHIFT     (0)                                           /* Bit 0 : Correct Hall Event Status */
#define POSIF_PFLG_CHES_MASK      (1 << POSIF_PFLG_CHES_SHIFT)
#define POSIF_PFLG_WHES_SHIFT     (1)                                           /* Bit 1 : Wrong Hall Event Status */
#define POSIF_PFLG_WHES_MASK      (1 << POSIF_PFLG_WHES_SHIFT)
#define POSIF_PFLG_HIES_SHIFT     (2)                                           /* Bit 2 : Hall Inputs Update Status */
#define POSIF_PFLG_HIES_MASK      (1 << POSIF_PFLG_HIES_SHIFT)
#define POSIF_PFLG_MSTS_SHIFT     (4)                                           /* Bit 4 : Multi-Channel pattern shadow transfer status */
#define POSIF_PFLG_MSTS_MASK      (1 << POSIF_PFLG_MSTS_SHIFT)
#define POSIF_PFLG_INDXS_SHIFT    (8)                                           /* Bit 8 : Quadrature Index Status */
#define POSIF_PFLG_INDXS_MASK     (1 << POSIF_PFLG_INDXS_SHIFT)
#define POSIF_PFLG_ERRS_SHIFT     (9)                                           /* Bit 9 : Quadrature phase Error Status */
#define POSIF_PFLG_ERRS_MASK      (1 << POSIF_PFLG_ERRS_SHIFT)
#define POSIF_PFLG_CNTS_SHIFT     (10)                                          /* Bit 10 : Quadrature CLK Status*/
#define POSIF_PFLG_CNTS_MASK      (1 << POSIF_PFLG_CNTS_SHIFT)
#define POSIF_PFLG_DIRS_SHIFT     (11)                                          /* Bit 11 : Quadrature Direction Change*/
#define POSIF_PFLG_DIRS_MASK      (1 << POSIF_PFLG_DIRS_SHIFT)
#define POSIF_PFLG_PCLKS_SHIFT    (12)                                          /* Bit 12 : Quadrature Period CLK Status*/
#define POSIF_PFLG_PCLKS_MASK     (1 << POSIF_PFLG_PCLKS_SHIFT)

/* PFLGE - POSIF interrupt enable */
#define POSIF_PFLGE_ECHE_SHIFT    (0)                                           /* Bit 0 : Correct Hall Event Enable */
#define POSIF_PFLGE_ECHE_MASK     (1 << POSIF_PFLGE_ECHE_SHIFT)
#define POSIF_PFLGE_EWHE_SHIFT    (1)                                           /* Bit 1 : Wrong Hall Event Enable */
#define POSIF_PFLGE_EWHE_MASK     (1 << POSIF_PFLGE_EWHE_SHIFT)
#define POSIF_PFLGE_EHIE_SHIFT    (2)                                           /* Bit 2 : Hall Input Update Enable */
#define POSIF_PFLGE_EHIE_MASK     (1 << POSIF_PFLGE_EHIE_SHIFT)
#define POSIF_PFLGE_EMST_SHIFT    (4)                                           /* Bit 4 : Multi-Channel pattern shadow transfer enable */
#define POSIF_PFLGE_EMST_MASK     (1 << POSIF_PFLGE_EMST_SHIFT)
#define POSIF_PFLGE_EINDX_SHIFT   (8)                                           /* Bit 8 : Quadrature Index Event Enable */
#define POSIF_PFLGE_EINDX_MASK    (1 << POSIF_PFLGE_EINDX_SHIFT)
#define POSIF_PFLGE_EERR_SHIFT    (9)                                           /* Bit 9 : Quadrature Phase Error Enable */
#define POSIF_PFLGE_EERR_MASK     (1 << POSIF_PFLGE_EERR_SHIFT)
#define POSIF_PFLGE_ECNT_SHIFT    (10)                                          /* Bit 10 : Quadrature CLK interrupt Enable */
#define POSIF_PFLGE_ECNT_MASK     (1 << POSIF_PFLGE_ECNT_SHIFT)
#define POSIF_PFLGE_EDIR_SHIFT    (11)                                          /* Bit 11 : Quadrature direction change interrupt Enable */
#define POSIF_PFLGE_EDIR_MASK     (1 << POSIF_PFLGE_EDIR_SHIFT)
#define POSIF_PFLGE_EPCLK_SHIFT   (12)                                          /* Bit 12 : Quadrature Period CLK interrupt Enable */
#define POSIF_PFLGE_EPCLK_MASK    (1 << POSIF_PFLGE_EPCLK_SHIFT)
#define POSIF_PFLGE_CHESEL_SHIFT  (16)                                          /* Bit 16 : Correct Hall Event Service Request Selector */
#define POSIF_PFLGE_CHESEL_MASK   (1 << POSIF_PFLGE_CHESEL_SHIFT)
#define POSIF_PFLGE_WHESEL_SHIFT  (17)                                          /* Bit 17 : Wrong Hall Event Service Request Selector */
#define POSIF_PFLGE_WHESEL_MASK   (1 << POSIF_PFLGE_WHESEL_SHIFT)
#define POSIF_PFLGE_HIESEL_SHIFT  (18)                                          /* Bit 18 : Hall Inputs Update Event Service Request Selector */
#define POSIF_PFLGE_HIESEL_MASK   (1 << POSIF_PFLGE_HIESEL_SHIFT)
#define POSIF_PFLGE_MSTSEL_SHIFT  (20)                                          /* Bit 20 : Multi-Channel pattern Update Event Service Request Selector */
#define POSIF_PFLGE_MSTSEL_MASK   (1 << POSIF_PFLGE_MSTSEL_SHIFT)
#define POSIF_PFLGE_INDSEL_SHIFT  (24)                                          /* Bit 24 : Quadrature Index Event Service Request Selector */
#define POSIF_PFLGE_INDSEL_MASK   (1 << POSIF_PFLGE_INDSEL_SHIFT)
#define POSIF_PFLGE_ERRSEL_SHIFT  (25)                                          /* Bit 25 : Quadrature Phase Error Event Service Request Selector */
#define POSIF_PFLGE_ERRSEL_MASK   (1 << POSIF_PFLGE_ERRSEL_SHIFT)
#define POSIF_PFLGE_CNTSEL_SHIFT  (26)                                          /* Bit 26 : Quadrature Clock Event Service Request Selector */
#define POSIF_PFLGE_CNTSEL_MASK   (1 << POSIF_PFLGE_CNTSEL_SHIFT)
#define POSIF_PFLGE_DIRSEL_SHIFT  (27)                                          /* Bit 27 : Quadrature Direction Update Event Service Request Selector */
#define POSIF_PFLGE_DIRSEL_MASK   (1 << POSIF_PFLGE_DIRSEL_SHIFT)
#define POSIF_PFLGE_PCLSEL_SHIFT  (28)                                          /* Bit 28 : Quadrature Period clock Event Service Request Selector */
#define POSIF_PFLGE_PCLSEL_MASK   (1 << POSIF_PFLGE_PCLSEL_SHIFT)

/* SPFLG - Interrupt set register */
#define POSIF_SPFLG_SCHE_SHIFT    (0)                                           /* Bit 0 : Correct Hall Event flag set */
#define POSIF_SPFLG_SCHE_MASK     (1 << POSIF_SPFLG_SCHE_SHIFT)
#define POSIF_SPFLG_SWHE_SHIFT    (1)                                           /* Bit 1 : Wrong Hall Event flag set */
#define POSIF_SPFLG_SWHE_MASK     (1 << POSIF_SPFLG_SWHE_SHIFT)
#define POSIF_SPFLG_SHIE_SHIFT    (2)                                           /* Bit 2 : Hall Inputs Update Event flag set */
#define POSIF_SPFLG_SHIE_MASK     (1 << POSIF_SPFLG_SHIE_SHIFT)
#define POSIF_SPFLG_SMST_SHIFT    (4)                                           /* Bit 4 : Multi-Channel Pattern shadow transfer flag set */
#define POSIF_SPFLG_SMST_MASK     (1 << POSIF_SPFLG_SMST_SHIFT)
#define POSIF_SPFLG_SINDX_SHIFT   (8)                                           /* Bit 8 : Quadrature Index flag set */
#define POSIF_SPFLG_SINDX_MASK    (1 << POSIF_SPFLG_SINDX_SHIFT)
#define POSIF_SPFLG_SERR_SHIFT    (9)                                           /* Bit 9 : Quadrature Phase Error flag set */
#define POSIF_SPFLG_SERR_MASK     (1 << POSIF_SPFLG_SERR_SHIFT)
#define POSIF_SPFLG_SCNT_SHIFT    (10)                                          /* Bit 10 : Quadrature CLK flag set */
#define POSIF_SPFLG_SCNT_MASK     (1 << POSIF_SPFLG_SCNT_SHIFT)
#define POSIF_SPFLG_SDIR_SHIFT    (11)                                          /* Bit 11 : Quadrature Direction flag set */
#define POSIF_SPFLG_SDIR_MASK     (1 << POSIF_SPFLG_SDIR_SHIFT)
#define POSIF_SPFLG_SPCLK_SHIFT   (12)                                          /* Bit 12 : Quadrature period clock flag set */
#define POSIF_SPFLG_SPCLK_MASK    (1 << POSIF_SPFLG_SPCLK_SHIFT)

/* RPFLG - Interrupt clear register */
#define POSIF_RPFLG_RCHE_SHIFT    (0)                                           /* Bit 0 : Correct Hall Event flag clear */
#define POSIF_RPFLG_RCHE_MASK     (1 << POSIF_RPFLG_RCHE_SHIFT)
#define POSIF_RPFLG_RWHE_SHIFT    (1)                                           /* Bit 1 : Wrong Hall Event flag clear */
#define POSIF_RPFLG_RWHE_MASK     (1 << POSIF_RPFLG_RWHE_SHIFT)
#define POSIF_RPFLG_RHIE_SHIFT    (2)                                           /* Bit 2 : Hall Inputs Update Event flag clear */
#define POSIF_RPFLG_RHIE_MASK     (1 << POSIF_RPFLG_RHIE_SHIFT)
#define POSIF_RPFLG_RMST_SHIFT    (4)                                           /* Bit 4 : Multi-Channel Pattern shadow transfer flag clear */
#define POSIF_RPFLG_RMST_MASK     (1 << POSIF_RPFLG_RMST_SHIFT)
#define POSIF_RPFLG_RINDX_SHIFT   (8)                                           /* Bit 8 : Quadrature Index flag clear */
#define POSIF_RPFLG_RINDX_MASK    (1 << POSIF_RPFLG_RINDX_SHIFT)
#define POSIF_RPFLG_RERR_SHIFT    (9)                                           /* Bit 9 : Quadrature Phase Error flag clear */
#define POSIF_RPFLG_RERR_MASK     (1 << POSIF_RPFLG_RERR_SHIFT)
#define POSIF_RPFLG_RCNT_SHIFT    (10)                                          /* Bit 10 : Quadrature CLK flag clear */
#define POSIF_RPFLG_RCNT_MASK     (1 << POSIF_RPFLG_RCNT_SHIFT)
#define POSIF_RPFLG_RDIR_SHIFT    (11)                                          /* Bit 11 : Quadrature Direction flag clear */
#define POSIF_RPFLG_RDIR_MASK     (1 << POSIF_RPFLG_RDIR_SHIFT)
#define POSIF_RPFLG_RPCLK_SHIFT   (12)                                          /* Bit 12 : Quadrature period clock flag clear */
#define POSIF_RPFLG_RPCLK_MASK    (1 << POSIF_RPFLG_RPCLK_SHIFT)

/* PDBG    */
#define POSIF_PDBG_QCSV_SHIFT     (0)                                           /* Quadrature Decoder Current state */
#define POSIF_PDBG_QCSV_MASK      (3 << POSIF_PDBG_QCSV_SHIFT)
#define POSIF_PDBG_QPSV_SHIFT     (2)                                           /* Quadrature Decoder Previous state */
#define POSIF_PDBG_QPSV_MASK      (3 << POSIF_PDBG_QPSV_SHIFT)
#define POSIF_PDBG_IVAL_SHIFT     (4)                                           /* Current Index Value */
#define POSIF_PDBG_IVAL_MASK      (1 << POSIF_PDBG_IVAL_SHIFT)
#define POSIF_PDBG_HSP_SHIFT      (5)                                           /* Hall Current Sampled Pattern */
#define POSIF_PDBG_HSP_MASK       (7 << POSIF_PDBG_HSP_SHIFT)
#define POSIF_PDBG_LPP0_SHIFT     (8)                                           /* Actual count of the Low Pass Filter for POSI0 */
#define POSIF_PDBG_LPP0_MASK      (0x3f << POSIF_PDBG_LPP0_SHIFT)
#define POSIF_PDBG_LPP1_SHIFT     (16)                                          /* Actual count of the Low Pass Filter for POSI1 */
#define POSIF_PDBG_LPP1_MASK      (0x3f << POSIF_PDBG_LPP1_SHIFT)
#define POSIF_PDBG_LPP2_SHIFT     (22)                                          /* Actual count of the Low Pass Filter for POSI2 */
#define POSIF_PDBG_LPP2_MASK      (0x3f << POSIF_PDBG_LPP2_SHIFT)